1 - Aprendendo a acessar os dados de um arquivo CSV.

In [4]:
import pandas as pd
arquivo = pd.read_csv("pessoas.csv")
display(arquivo)

      Nome  Idade  Peso  Altura
0  Jubileu     35    75    1.78
1    Maria     27    68    1.68
2    Pedro     18    85    1.71
3      Ana     22    70    1.75
4  Gustavo     45    73    1.63
5    Laura     29    67    1.68

2 - Filtragem dos dados presentes um uma linha

In [5]:
linha = arquivo.loc[2]
print(linha)

Nome      Pedro
Idade        18
Peso         85
Altura     1.71
Name: 2, dtype: object

3 - Filtragem de um especifico da planilha.

In [10]:
dado = arquivo.iloc[5,3]
print(f"Nome: {dado}")

dado2 = arquivo.iloc[3,3] #altura de ana
print(f"Nome: {dado2}")

Nome: 1.68
Nome: 1.75

4 - Calculando o IMC da Laura.

In [11]:
nome = arquivo.iloc[5,0]
peso = arquivo.iloc[5,2]
altura = arquivo.iloc[5,3]

imc = (peso/(altura*altura))

print(f"{nome} possui o imc {imc:.2f}")

Laura possui o imc 23.74

5 - Calculo do IMC de todas as pessoas da planilha.

In [12]:


dados = {'Nomes': [], 'IMC': [] }

for x in range(6):
    nome = arquivo.iloc[x,0]
    peso = arquivo.iloc[x,2]
    altura = arquivo.iloc[x,3]
    
    imc = (peso/(altura*altura))
    imc = (f"{imc:.2f}")

    dados['Nomes'].append(nome)
    dados['IMC'].append(nome)

    nova_tabela = pd.DataFrame(dados)
    display(nova_tabela)

    #Criando um novo arquivo com o IMC de todas as pessoas
    nova_tabela.to_excel('imc_grupos.xlsx', index=False)

     Nomes      IMC
0  Jubileu  Jubileu

     Nomes      IMC
0  Jubileu  Jubileu
1    Maria    Maria

     Nomes      IMC
0  Jubileu  Jubileu
1    Maria    Maria
2    Pedro    Pedro

     Nomes      IMC
0  Jubileu  Jubileu
1    Maria    Maria
2    Pedro    Pedro
3      Ana      Ana

     Nomes      IMC
0  Jubileu  Jubileu
1    Maria    Maria
2    Pedro    Pedro
3      Ana      Ana
4  Gustavo  Gustavo

     Nomes      IMC
0  Jubileu  Jubileu
1    Maria    Maria
2    Pedro    Pedro
3      Ana      Ana
4  Gustavo  Gustavo
5    Laura    Laura